
{
    "info": {
        "title": "Chaingateway public API",
        "version": "2.0.0-beta",
        "description": "Blockchain API to build the bridge between Blockchain and the real world\r\n# Introduction\r\n This API allows you to interact with Ethereum, Binance smartchain and Tron blockchain. If you ever looked for a possibility to automate token or payments this is the right place.\r\nYou still have no idea for real use cases? Let me give you some examples: Accept your own token as payment method for your shop, distribute airdrop tokens of your ICO, convert your site currency to a token that can be traded on exchanges and many more.\r\nThere are a lot of use cases which are not only limited to sending tokens but also receiving them. You could even create a secure wallet for your token which only the wallet owner has access to.\r\n# Endpoints\r\n At the moment we only have an production endpoint. Its reachable at  \r\n\r\n **api.chaingateway.io** \r\n# Postman\r\nPostman is a great software to test APIs, it helped us a lot when developing this API. If you haven't installed it yet, you can download it here.\r\nWe have created a Postman collection that allows to import all functions and their settings, including descriptions in Postman. This way you can test all functions with the click of a button (just change the parameters before).\r\nYou can import the collection by clicking the button below:\r\n\r\n [![Run in Postman](https://run.pstmn.io/button.svg)](https://www.postman.com/chaingatewayio/workspace/chaingatewayio-s-public-workspace/collection/9482443-c79c629f-bbbf-477e-af13-1d9951e86a4d?action=share&creator=18417706)\r\n# Authorization\r\nYou can get your personal API Key from your account dashboard. It is used by us to determine who is accessing the API and to count the requests by that account. \r\nAdd it in the HTTP header\r\n\r\n`Authorization: q9PdaWuD4j6DK6vsUgehhL8pgarSrS9m`\r\n\r\nPlease do not share your api key! If you did so by mistake, immediately delete it in your account panel and create a new one!",
        "termsOfService": "https://chaingateway.io",
        "contact": {
            "name": "Chaingateway.io support",
            "url": "https://support.bitblade.io",
            "email": "support@chaingateway.io"
        },
        "xLogo": {
            "url": "logo.png",
            "backgroundColor": "#FFFFFF",
            "altText": "Chaingateway Logo"
        }
    },
    "outputFormat": "json",
    "servers": [
    {
        "url": "https://api.chaingateway.io",
        "description": "Production environment server"
    }
    ]
}
